SAMS0N1TE/LakeShark/main/flipper_link.c
#include "flipper_link.h"

#include <ctype.h>
#include <strings.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/uart.h"
#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_rom_sys.h"
#include "soc/soc_caps.h"

#include "lakeshark_backend.h"
#include "fm_state.h"
#include "fm_mode_label.h"
#include "audio_out.h"
#include "audio_eq.h"
#include "tone.h"
#include "ls_board.h"
#include "flipper_link_telemetry.h"
#include "ble_link.h"
#include "rec_state.h"
/*LS-411*/
#include "radio_health.h"
/*LS-220*/
#include "ls_version.h"

static const char *TAG = "fl_link";

#define FL_LINE_MAX    192
/*LS-511*/
#define REPLY_MAX   384
#define TEL_MAX     576
#define RX_BUF_SZ   1024
#define TX_BUF_SZ   2048

static flipper_link_cfg_t s_cfg      = FLIPPER_LINK_CFG_DEFAULT();
static flipper_link_host_t s_host    = { 0 };
static TaskHandle_t       s_task     = NULL;
static volatile bool      s_run      = false;
static volatile bool      s_verbose  = false;
static volatile bool      s_installed = false;

static uint32_t s_rx_lines  = 0;
static uint32_t s_tx_lines  = 0;
static uint32_t s_bad_lines = 0;

static volatile bool s_stat_now = false;

static esp_err_t link_install(void);
static void      link_uninstall(void);

typedef enum { HOST_MODE_P25, HOST_MODE_ADSB, HOST_MODE_FM, HOST_MODE_REC } host_mode_t;

static host_mode_t host_mode(void)
{
    const char *n = s_host.current_mode_name ? s_host.current_mode_name() : "P25";
    if (!n) return HOST_MODE_P25;
    if (!strcasecmp(n, "FM"))    return HOST_MODE_FM;
    if (!strcasecmp(n, "ADS-B")) return HOST_MODE_ADSB;
    if (!strcasecmp(n, "ADSB"))  return HOST_MODE_ADSB;
    /*LS-510*/
    if (!strcasecmp(n, "REC"))   return HOST_MODE_REC;
    return HOST_MODE_P25;
}

static void str_upper(char *s)
{
    for (; *s; s++) *s = (char)toupper((unsigned char)*s);
}

static int tokenize(char *line, char **argv, int max)
{
    int argc = 0;
    char *p = line;
    while (*p && argc < max) {
        while (*p == ' ' || *p == '\t') p++;
        if (!*p) break;
        argv[argc++] = p;
        while (*p && *p != ' ' && *p != '\t') p++;
        if (*p) *p++ = '\0';
    }
    return argc;
}

static void sanitize(char *s)
{
    for (; *s; s++) {
        if (*s == ' ' || *s == '\t' || *s == '=' || *s == '\r' || *s == '\n') *s = '_';
    }
}

static bool parse_i32(const char *s, int32_t *out)
{
    if (!s || !*s) return false;
    char *end = NULL;
    long v = strtol(s, &end, 0);
    if (end == s) return false;
    while (*end == ' ') end++;
    if (*end) return false;
    *out = (int32_t)v;
    return true;
}

static bool parse_freq_hz(const char *s, uint32_t *out)
{
    if (!s || !*s) return false;
    char *end = NULL;
    double v = strtod(s, &end);
    if (end == s || v <= 0) return false;
    if (v < 10000.0) v *= 1e6;
    if (v < 1e6 || v > 2.0e9) return false;
    *out = (uint32_t)(v + 0.5);
    return true;
}

/*LS-411*/
static int sdr_stall_s(void)
{
    radio_health_snapshot_t health;
    return radio_health_get(LS_RADIO_ENDPOINT_RTL_USB, &health)
               ? health.stall_s : 0;
}

static void sdr_stall_reset(void)
{
    radio_health_note_progress_reset(LS_RADIO_ENDPOINT_RTL_USB);
}

static rh_state_t sdr_health_state(void)
{
    radio_health_snapshot_t health;
    return radio_health_get(LS_RADIO_ENDPOINT_RTL_USB, &health)
               ? health.state : RH_ABSENT;
}

static ls_telemetry_common_t telemetry_common(void)
{
    uint32_t fi = 0, fd = 0, fp = 0;
    if (s_host.heap_stats) s_host.heap_stats(&fi, &fd, &fp);

    return (ls_telemetry_common_t){
        .volume = audio_volume_get(),
        .muted = audio_is_muted() ? 1 : 0,
        .rtl_ready = lakeshark_iq_receiver_ready() ? 1 : 0,
        .uptime_s = s_host.uptime_s ? s_host.uptime_s() : 0,
        .free_internal = fi,
        .free_dma = fd,
        .sdr_stall_s = sdr_stall_s(),
        .rhs_state = radio_health_state_name(sdr_health_state()),
    };
}

int flipper_link_eq_snapshot(char *buf, size_t len)
{
    if (!buf || len < 8) return 0;

    audio_eq_cfg_t eq;
    audio_eq_get(&eq);

    int n = snprintf(buf, len, "& eq=%d eh=%d eb=%d et=%d ep=%d el=%d egr=%d\n",
                     eq.preset, eq.hp10 * 10, eq.bass_db, eq.treb_db,
                     eq.punch, eq.loud, audio_eq_gr_db10());
    if (n < 0) return 0;
    if ((size_t)n >= len) n = (int)len - 1;
    return n;
}

static int build_telemetry_fm(char *buf, size_t len)
{
    lakeshark_fm_tel_t t;
    lakeshark_fm_telemetry(&t);
    ls_telemetry_common_t common = telemetry_common();
    return ls_telemetry_build_fm(buf, len, &t, &common);
}

#define AC_PER_FRAME 4

static int build_telemetry_adsb(char *buf, size_t len)
{
    lakeshark_adsb_tel_t t;
    lakeshark_adsb_telemetry(&t);
    ls_telemetry_common_t common = telemetry_common();
    return ls_telemetry_build_adsb(buf, len, &t, &common);
}

static int build_telemetry_p25(char *buf, size_t len)
{
    lakeshark_p25_tel_t t;
    lakeshark_p25_telemetry(&t);
    const char *mode = (s_host.current_mode_name ? s_host.current_mode_name() : "P25");
    ls_telemetry_common_t common = telemetry_common();
    return ls_telemetry_build_p25(buf, len, &t, mode, lakeshark_p25_mode_name(),
                                  &common);
}

/*LS-510*/
static int build_telemetry_rec(char *buf, size_t len)
{
    rec_status_t s;
    rec_get_status(&s);
    ls_telemetry_common_t common = telemetry_common();
    return ls_telemetry_build_rec(buf, len, &s, &common);
}

static int build_telemetry(char *buf, size_t len)
{
    int n;
    switch (host_mode()) {
    case HOST_MODE_FM:   n = build_telemetry_fm(buf, len);   break;
    case HOST_MODE_ADSB: n = build_telemetry_adsb(buf, len); break;
    case HOST_MODE_REC:  n = build_telemetry_rec(buf, len);  break;
    default:             n = build_telemetry_p25(buf, len);  break;
    }
    if (n < 0) return n;

    if ((size_t)n >= len - 2) n = (int)len - 2;

    buf[n++] = '\n';
    buf[n]   = '\0';
    return n;
}

static void eq_reply(char *reply, size_t reply_len)
{
    audio_eq_cfg_t eq;
    audio_eq_get(&eq);
    snprintf(reply, reply_len,
             "+OK eq=%s hp=%d bass=%+d treb=%+d punch=%d loud=%d\n",
             audio_eq_preset_name(eq.preset), eq.hp10 * 10,
             eq.bass_db, eq.treb_db, eq.punch, eq.loud);
}

