SAMS0N1TE/LakeShark/main/flipper_link.c
static void receiver_reply(char *reply, size_t reply_len)
{
    if (!reply || reply_len == 0) return;
    static const char prefix[] = "+OK ";
    if (reply_len <= sizeof(prefix) - 1) {
        reply[0] = '\0';
        return;
    }
    memcpy(reply, prefix, sizeof(prefix));
    size_t used = sizeof(prefix) - 1;
    int n = lakeshark_receiver_status(reply + used, reply_len - used);
    if (n < 0) n = 0;
    used += strnlen(reply + used, reply_len - used);
    if (used + 1 < reply_len) {
        reply[used++] = '\n';
        reply[used] = '\0';
    } else if (reply_len >= 2) {
        reply[reply_len - 2] = '\n';
        reply[reply_len - 1] = '\0';
    }
}

/*LS-511*/
#define REC_CHUNK_EDGES 32

static void rec_reply_status(char *reply, size_t reply_len)
{
    rec_status_t s;
    rec_get_status(&s);
    snprintf(reply, reply_len,
             "+OK ph=%d e=%d sp=%lu f=%lu th=%d gp=%d"
             /*LS-516*/
             " bw=%lu mp=%lu ms=%lu me=%d\n",
             (int)s.phase, s.edges, (unsigned long)s.span_us,
             (unsigned long)s.freq_hz, s.thresh_fixed, s.gap_ms,
             (unsigned long)s.bw_hz, (unsigned long)s.min_pulse_us,
             (unsigned long)(s.max_span_us / 1000u), s.min_edges);
}

static void handle_rec(int argc, char **argv, char *reply, size_t reply_len)
{
    const char *sub = (argc > 1) ? argv[1] : NULL;
    const char *arg = (argc > 2) ? argv[2] : NULL;
    int32_t n = 0;

    if (!sub) {
        rec_reply_status(reply, reply_len);
        return;
    }

    char up[16];
    strlcpy(up, sub, sizeof(up));
    str_upper(up);

    if (!strcmp(up, "ARM")) {
        /*LS-506*/
        if (host_mode() != HOST_MODE_REC && s_host.select_mode_by_name) {
            sdr_stall_reset();
            s_host.select_mode_by_name("rec");
        }
        rec_arm_request();
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "STOP")) {
        rec_disarm();
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "FREQ")) {
        uint32_t hz;
        if (!arg || !parse_freq_hz(arg, &hz)) {
            snprintf(reply, reply_len, "-ERR rec freq\n");
            return;
        }
        rec_set_freq(hz);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "GAIN")) {
        if (!arg || !parse_i32(arg, &n)) {
            snprintf(reply, reply_len, "-ERR rec gain\n");
            return;
        }
        rec_set_gain((int)n);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "THRESH")) {
        /*LS-503*/
        if (!arg || !parse_i32(arg, &n)) {
            snprintf(reply, reply_len, "-ERR rec thresh\n");
            return;
        }
        rec_set_thresh((int)n);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "GAP")) {
        /*LS-504*/
        if (!arg || !parse_i32(arg, &n)) {
            snprintf(reply, reply_len, "-ERR rec gap\n");
            return;
        }
        rec_set_gap_ms((int)n);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "BW")) {
        /*LS-516*/
        if (!arg || !parse_i32(arg, &n)) {
            snprintf(reply, reply_len, "-ERR rec bw\n");
            return;
        }
        rec_set_bw(n > 0 ? (uint32_t)n : 0);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "MINP")) {
        /*LS-516*/
        if (!arg || !parse_i32(arg, &n) || n <= 0) {
            snprintf(reply, reply_len, "-ERR rec minp\n");
            return;
        }
        rec_set_min_pulse((uint32_t)n);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "MAXSPAN")) {
        /*LS-516*/
        if (!arg || !parse_i32(arg, &n) || n <= 0) {
            snprintf(reply, reply_len, "-ERR rec maxspan\n");
            return;
        }
        rec_set_max_span((uint32_t)n * 1000u);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "MINEDGES")) {
        /*LS-516*/
        if (!arg || !parse_i32(arg, &n) || n <= 0) {
            snprintf(reply, reply_len, "-ERR rec minedges\n");
            return;
        }
        rec_set_min_edges((int)n);
        s_stat_now = true;
        rec_reply_status(reply, reply_len);

    } else if (!strcmp(up, "SAVE")) {
        char path[64];
        int w = rec_save(arg && *arg ? arg : "capture", path, sizeof(path));
        if (w > 0)       snprintf(reply, reply_len, "+OK saved %s %d\n", path, w);
        else if (w == -1) snprintf(reply, reply_len, "-ERR nothing captured\n");
        /*LS-513*/
        else if (w == -3) snprintf(reply, reply_len, "-ERR rec busy\n");
        else              snprintf(reply, reply_len, "-ERR write %d\n", w);

    } else if (!strcmp(up, "LS")) {
        /*LS-032*/
        /* One saved capture per round trip:
               %S <index> <total> <freq_hz> <bytes> <name>
           A zero total means nothing is saved. The head walks index 0..total-1
           to build its list. Deliberately NOT one reply carrying every name -
           REPLY_MAX is 384 and a directory has no bound, so that reply would
           truncate silently, which is the failure LS-515 was written about. */
        int32_t idx = 0;
        if (arg && !parse_i32(arg, &idx)) {
            snprintf(reply, reply_len, "-ERR rec ls\n");
            return;
        }
        char name[40];
        uint32_t freq = 0;
        long size = -1;
        int total = rec_file_info((int)idx, name, sizeof(name), &freq, &size);
        if (total <= 0 || idx < 0 || idx >= total) {
            snprintf(reply, reply_len, "%%S %ld %d 0 0 -\n", (long)idx, total);
            return;
        }
        snprintf(reply, reply_len, "%%S %ld %d %lu %ld %s\n",
                 (long)idx, total, (unsigned long)freq, size, name);

    } else if (!strcmp(up, "LOAD")) {
        /*LS-032*/
        int32_t idx = 0;
        if (!arg || !parse_i32(arg, &idx)) {
            snprintf(reply, reply_len, "-ERR rec load\n");
            return;
        }
        int n = rec_load((int)idx);
        if (n == -3)      snprintf(reply, reply_len, "-ERR rec busy\n");
        else if (n == -1) snprintf(reply, reply_len, "-ERR no such capture\n");
        else if (n < 0)   snprintf(reply, reply_len, "-ERR load %d\n", n);
        else {
            s_stat_now = true;
            rec_reply_status(reply, reply_len);
        }

