SAMS0N1TE/LakeShark/main/flipper_link.c
    } else if (!strcmp(up, "DEL")) {
        /*LS-032*/
        int32_t idx = 0;
        if (!arg || !parse_i32(arg, &idx)) {
            snprintf(reply, reply_len, "-ERR rec del\n");
            return;
        }
        char name[40];
        int total = rec_file_info((int)idx, name, sizeof(name), NULL, NULL);
        if (total <= 0 || idx < 0 || idx >= total) {
            snprintf(reply, reply_len, "-ERR no such capture\n");
            return;
        }
        snprintf(reply, reply_len, rec_remove(name) == 0
                 ? "+OK deleted %s\n" : "-ERR delete %s\n", name);

    } else if (!strcmp(up, "GET")) {
        /*LS-511*/
        int32_t off = 0;
        if (arg && !parse_i32(arg, &off)) {
            snprintf(reply, reply_len, "-ERR rec get\n");
            return;
        }
        int32_t edge[REC_CHUNK_EDGES];
        int got = rec_edges_copy((int)off, edge, REC_CHUNK_EDGES);
        if (got < 0) {
            snprintf(reply, reply_len, "-ERR rec busy\n");
            return;
        }
        int w = snprintf(reply, reply_len, "%%D %ld %d", (long)off, got);
        for (int i = 0; i < got && w > 0 && (size_t)w < reply_len - 2; i++) {
            int k = snprintf(reply + w, reply_len - (size_t)w, " %ld", (long)edge[i]);
            if (k < 0) break;
            w += k;
        }
        if (w < 0) w = 0;
        if ((size_t)w > reply_len - 2) w = (int)reply_len - 2;
        reply[w++] = '\n';
        reply[w]   = '\0';

    } else {
        snprintf(reply, reply_len,
                 "-ERR rec <arm|stop|freq|gain|thresh|gap|bw|minp|maxspan|"
                 "minedges|save|get|ls|load|del>\n");
    }
}

static void handle_line(char *line, char *reply, size_t reply_len)
{
    reply[0] = '\0';

    char *argv[8];
    int argc = tokenize(line, argv, 8);
    if (argc == 0) return;

    str_upper(argv[0]);
    const char *cmd = argv[0];
    const char *a1  = (argc > 1) ? argv[1] : NULL;
    int32_t     n   = 0;

    if (!strcmp(cmd, "PING")) {
        snprintf(reply, reply_len, "+PONG %d LakeShark\n", FLIPPER_LINK_PROTO_VERSION);

    /*LS-220*/
    /* `VER` - one line describing the firmware, so the head can put "which
       LakeShark am I talking to" next to its own version.  The line is
       assembled by ls_version_format() and covered by test_ls_version, so
       the string here cannot silently drift out of shape.  sanitize()
       swaps whitespace and '=' for '_' so a single reply line survives
       the protocol without needing a special-case parser. */
    } else if (!strcmp(cmd, "VER")) {
        char v[LS_VERSION_LINE_MAX];
        ls_version_line(v, sizeof(v));
        sanitize(v);
        snprintf(reply, reply_len, "+OK %s\n", v);

    } else if (!strcmp(cmd, "STAT")) {
        s_stat_now = true;
        receiver_reply(reply, reply_len);

    } else if (!strcmp(cmd, "FREQ")) {
        uint32_t hz;
        if (!a1) {
            receiver_reply(reply, reply_len);
        } else if (!parse_freq_hz(a1, &hz)) {
            snprintf(reply, reply_len, "-ERR freq\n");
        } else if (host_mode() == HOST_MODE_ADSB) {
            snprintf(reply, reply_len, "-ERR adsb is fixed at 1090 MHz\n");
        } else {

            /*LS-510*/ /*LS-416*/
            sdr_stall_reset();
            if      (host_mode() == HOST_MODE_FM)  lakeshark_fm_set_freq(hz);
            else if (host_mode() == HOST_MODE_REC) rec_set_freq(hz);
            else                                   lakeshark_p25_set_freq(hz);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK f=%lu\n", (unsigned long)hz);
        }

    } else if (!strcmp(cmd, "TUNE")) {
        if (!a1 || !parse_i32(a1, &n)) {
            snprintf(reply, reply_len, "-ERR tune\n");
        } else if (host_mode() == HOST_MODE_ADSB) {
            snprintf(reply, reply_len, "-ERR adsb is fixed at 1090 MHz\n");
        } else {
            uint32_t now;
            /*LS-416*/
            sdr_stall_reset();
            if (host_mode() == HOST_MODE_FM) {
                lakeshark_fm_tune((int)n);
                now = lakeshark_fm_get_freq();
            } else if (host_mode() == HOST_MODE_REC) {
                /*LS-510*/
                int64_t want = (int64_t)rec_get_freq() + n;
                if (want < 1000000LL)    want = 1000000LL;
                if (want > 2000000000LL) want = 2000000000LL;
                rec_set_freq((uint32_t)want);
                now = rec_get_freq();
            } else {
                lakeshark_p25_tune((int)n);
                now = lakeshark_p25_get_freq();
            }
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK f=%lu\n", (unsigned long)now);
        }

    } else if (!strcmp(cmd, "FM")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK fm=%s\n", fm_mode_command_name(
                     (fm_mode_t)lakeshark_fm_get_mode()));
            return;
        }

        fm_mode_t mode;
        if (!fm_mode_parse(a1, &mode)) {
            snprintf(reply, reply_len, "-ERR fm\n");
            return;
        }

        if (host_mode() != HOST_MODE_FM && s_host.select_mode_by_name) {
            sdr_stall_reset();
            s_host.select_mode_by_name("fm");
        }
        /* The LCD host switch is asynchronous. lakeshark_fm_set_mode() is a
           persistent request latch consumed by fm_rx_task after AppFM enters,
           so issue it after validation even while P25 is still reported. */
        lakeshark_fm_set_mode((int)mode);
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK fm=%s\n", fm_mode_command_name(mode));

    } else if (!strcmp(cmd, "SQL")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else if (a1[0] == '+' || a1[0] == '-') {
            if (!parse_i32(a1, &n)) { snprintf(reply, reply_len, "-ERR sql\n"); return; }
            lakeshark_fm_squelch_delta((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else if (parse_i32(a1, &n)) {
            lakeshark_fm_set_squelch((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else {
            snprintf(reply, reply_len, "-ERR sql\n");
        }

    } else if (!strcmp(cmd, "BAUD")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK pb=%d\n", lakeshark_fm_get_baud());
        } else if (parse_i32(a1, &n)) {
            lakeshark_fm_set_baud((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK pb=%d\n", lakeshark_fm_get_baud());
        } else {
            snprintf(reply, reply_len, "-ERR baud\n");
        }

    } else if (!strcmp(cmd, "SCAN")) {
        lakeshark_fm_scan_restart();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK\n");

    } else if (!strcmp(cmd, "PEAK")) {
        lakeshark_fm_tune_to_peak();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK f=%lu\n",
                 (unsigned long)lakeshark_fm_get_freq());

