SAMS0N1TE/LakeShark/main/flipper_link.c
    } else if (!strcmp(cmd, "VOL")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK v=%d\n", audio_volume_get());
        } else if (a1[0] == '+' || a1[0] == '-') {
            if (!parse_i32(a1, &n)) { snprintf(reply, reply_len, "-ERR vol\n"); return; }
            audio_volume_delta((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK v=%d\n", audio_volume_get());
        } else if (parse_i32(a1, &n)) {
            if (n < 0) n = 0;
            if (n > 100) n = 100;
            audio_volume_set((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK v=%d\n", audio_volume_get());
        } else {
            snprintf(reply, reply_len, "-ERR vol\n");
        }

    } else if (!strcmp(cmd, "MUTE")) {
        if (!a1) {
            audio_toggle_mute();
        } else if (parse_i32(a1, &n)) {
            bool want = (n != 0);
            if (audio_is_muted() != want) audio_toggle_mute();
        } else {
            snprintf(reply, reply_len, "-ERR mute\n");
            return;
        }
        if (!audio_is_muted()) audio_out_ensure_unmuted();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK mu=%d\n", audio_is_muted() ? 1 : 0);

    } else if (!strcmp(cmd, "GAIN")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK g=%d\n", lakeshark_p25_gain_tenths());
            return;
        }
        char up[16];
        strlcpy(up, a1, sizeof(up));
        str_upper(up);
        if (!strcmp(up, "AUTO")) {
            /*LS-510*/
            if (host_mode() == HOST_MODE_REC) rec_set_gain(0);
            else                              lakeshark_p25_agc();
        } else if (!strcmp(up, "STEP")) {
            lakeshark_p25_gain_step();
        } else if (parse_i32(a1, &n)) {
            if (n < 0) n = 0;
            if (n > 496) n = 496;
            /*LS-510*/
            if (host_mode() == HOST_MODE_REC) rec_set_gain((int)n);
            else                              lakeshark_radio_set_gain((int)n);
        } else {
            snprintf(reply, reply_len, "-ERR gain\n");
            return;
        }
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK g=%d\n", lakeshark_p25_gain_tenths());

    } else if (!strcmp(cmd, "DEMOD")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK dm=%d %s\n",
                     lakeshark_p25_mode_index(), lakeshark_p25_mode_name());
            return;
        }
        char up[16];
        strlcpy(up, a1, sizeof(up));
        str_upper(up);
        if (!strcmp(up, "CYCLE")) {
            lakeshark_p25_cycle_mode();
        } else if (!strcmp(up, "AUTO")) {
            lakeshark_p25_set_mode(-1);
        } else if (parse_i32(a1, &n) && n >= -1 && n <= 3) {
            lakeshark_p25_set_mode((int)n);
        } else {
            snprintf(reply, reply_len, "-ERR demod\n");
            return;
        }
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK dm=%d %s\n",
                 lakeshark_p25_mode_index(), lakeshark_p25_mode_name());

    } else if (!strcmp(cmd, "POL")) {
        lakeshark_p25_toggle_polarity();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK pol=%d\n",
                 lakeshark_p25_polarity_inverted() ? 1 : 0);

    } else if (!strcmp(cmd, "BEEP")) {

        if (a1 && !strcasecmp(a1, "NOW")) {
            if (!s_host.play_test_sound) {
                snprintf(reply, reply_len, "-ERR no test sound\n");
                return;
            }
            s_host.play_test_sound();
            snprintf(reply, reply_len, "+OK beep now\n");
            return;
        }
        if (!a1) {
            lakeshark_p25_beep_toggle();
        } else if (parse_i32(a1, &n)) {
            if (lakeshark_p25_beep_enabled() != (n != 0)) lakeshark_p25_beep_toggle();
        } else {
            snprintf(reply, reply_len, "-ERR beep\n");
            return;
        }
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK bp=%d\n",
                 lakeshark_p25_beep_enabled() ? 1 : 0);

    } else if (!strcmp(cmd, "VGATE")) {
        if (!a1 || !parse_i32(a1, &n)) {
            snprintf(reply, reply_len, "-ERR vgate\n");
        } else {
            lakeshark_p25_set_voice_gate((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK vg=%d\n", lakeshark_p25_voice_gate());
        }

    } else if (!strcmp(cmd, "RESET")) {
        lakeshark_p25_reset_stats();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK\n");

    } else if (!strcmp(cmd, "REC")) {
        /*LS-511*/
        handle_rec(argc, argv, reply, reply_len);

    } else if (!strcmp(cmd, "MODE")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK md=%s\n",
                     s_host.current_mode_name ? s_host.current_mode_name() : "?");
            return;
        }
        if (!s_host.select_mode_by_name) {
            snprintf(reply, reply_len, "-ERR nomode\n");
            return;
        }
        sdr_stall_reset();
        s_host.select_mode_by_name(a1);
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK md=%s\n",
                 s_host.current_mode_name ? s_host.current_mode_name() : "?");

    } else if (!strcmp(cmd, "REBOOT")) {
        if (!s_host.reboot) {
            snprintf(reply, reply_len, "-ERR no reboot hook\n");
            return;
        }

        snprintf(reply, reply_len, "+OK rebooting\n");
        s_host.reboot();

    } else if (!strcmp(cmd, "LOG")) {

        if (!s_host.set_log_level) {
            snprintf(reply, reply_len, "-ERR no log hook\n");
            return;
        }
        const char *a2 = (argc > 2) ? argv[2] : NULL;
        const char *tag = a1 ? a1 : "*";
        const char *lvl = a2 ? a2 : a1;
        if (!lvl) { snprintf(reply, reply_len, "-ERR log <tag|*> <level>\n"); return; }
        if (!a2) tag = "*";
        if (s_host.set_log_level(tag, lvl)) {
            snprintf(reply, reply_len, "+OK log %s=%s\n", tag, lvl);
        } else {
            snprintf(reply, reply_len, "-ERR level (none|error|warn|info|debug|verbose)\n");
        }

    } else if (!strcmp(cmd, "SYS")) {
        if (!s_host.sys_info) {
            snprintf(reply, reply_len, "-ERR no sys hook\n");
            return;
        }
        char info[192];
        info[0] = '\0';
        s_host.sys_info(info, sizeof(info));
        sanitize(info);
        snprintf(reply, reply_len, "+OK %s\n", info);

    } else if (!strcmp(cmd, "C6")) {

