SAMS0N1TE/LakeShark/main/flipper_link.c
    flipper_link_cfg_t saved = s_cfg;
    bool was_running = s_run;
    if (was_running) flipper_link_stop();

    s_cfg.tx_gpio = -1;
    esp_err_t err = link_install();
    if (err != ESP_OK) {
        printf("scan: uart install failed: %s\n", esp_err_to_name(err));
        s_cfg = saved;
        if (was_running) flipper_link_start(&s_cfg, NULL);
        return -1;
    }

    printf("scanning %d pins, %d ms each (drive the head so it keeps talking)\n",
           N_SCAN_PINS, dwell_ms);

    int best = -1;
    size_t best_n = 0;
    for (int i = 0; i < N_SCAN_PINS; i++) {
        int pin = SCAN_PINS[i];

        if (uart_set_pin(s_cfg.uart_num, UART_PIN_NO_CHANGE, pin,
                         UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE) != ESP_OK) {
            printf("  GPIO%-2d : (cannot route)\n", pin);
            continue;
        }
        uart_flush_input(s_cfg.uart_num);
        vTaskDelay(pdMS_TO_TICKS(dwell_ms));

        size_t avail = 0;
        uart_get_buffered_data_len(s_cfg.uart_num, &avail);

        char peek[33] = { 0 };
        if (avail) {
            int n = uart_read_bytes(s_cfg.uart_num, (uint8_t *)peek,
                                    avail > 32 ? 32 : avail, 0);
            for (int k = 0; k < n; k++) {
                if (peek[k] < 32 || peek[k] > 126) peek[k] = '.';
            }
            peek[n > 0 ? n : 0] = '\0';
        }
        printf("  GPIO%-2d : %4u bytes  %s\n", pin, (unsigned)avail, peek);

        if (avail > best_n) { best_n = avail; best = pin; }
        uart_flush_input(s_cfg.uart_num);
    }

    link_uninstall();
    s_cfg = saved;
    if (was_running) flipper_link_start(&s_cfg, NULL);

    if (best >= 0) printf("scan: busiest pin GPIO%d (%u bytes)\n", best, (unsigned)best_n);
    else           printf("scan: nothing heard on any pin\n");
    return best;
}

static int probe_pin_pct(int pin)
{
    gpio_config_t in = {
        .pin_bit_mask = 1ULL << pin,
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_ENABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    if (gpio_config(&in) != ESP_OK) return -1;

    vTaskDelay(pdMS_TO_TICKS(5));

    int high = 0;
    const int samples = 200;
    for (int i = 0; i < samples; i++) {
        if (gpio_get_level(pin)) high++;
        esp_rom_delay_us(100);
    }

    in.pull_down_en = GPIO_PULLDOWN_DISABLE;
    gpio_config(&in);

    return (high * 100) / samples;
}

int flipper_link_probe_rx(void)
{
    flipper_link_cfg_t saved = s_cfg;
    bool was_running = s_run;
    if (was_running) flipper_link_stop();

    esp_log_level_t gpio_lvl = esp_log_level_get("gpio");
    esp_log_level_set("gpio", ESP_LOG_WARN);

    printf("probing %d header pins with a pull-down.\n"
           "  ~100%% = something external is driving it high (an idle UART TX)\n"
           "  <100%% = that line is also carrying traffic\n"
           "     0%% = nothing connected, or the far end is unpowered\n",
           N_SCAN_PINS);

    int best = -1, best_pct = 0, found = 0;
    for (int i = 0; i < N_SCAN_PINS; i++) {
        int pin = SCAN_PINS[i];
        /*LS-203*/
        if (LS_HAS_VBUS_CTRL && pin == VBUS_EN_GPIO) continue;
        if (pin == C6_EN_GPIO) continue;

        int pct = probe_pin_pct(pin);
        if (pct < 0) {
            printf("  GPIO%-2d : (cannot configure)\n", pin);
            continue;
        }

        bool baseline = pin_idles_high(pin);
        printf("  GPIO%-2d : %3d%% high%s\n", pin, pct,
               baseline ? "   (board pull-up, ignored)"
                        : (pct > 0 ? "   <-- driven" : ""));
        if (baseline) continue;

        if (pct > 0) found++;
        if (pct > best_pct) { best_pct = pct; best = pin; }
    }

    if (best >= 0) {
        printf("probe: GPIO%d is being driven (%d%%). %d pin(s) driven in total.\n",
               best, best_pct, found);
        if (best != saved.rx_gpio) {
            printf("probe: the link expects RX on GPIO%d - the wire is on the "
                   "wrong pin. `link pins %d %d` to adopt it.\n",
                   saved.rx_gpio, best, saved.tx_gpio);
        } else {
            printf("probe: that is the configured RX pin - wiring is good.\n");
        }
    } else {
        printf("probe: every pin followed the pull-down - the head's TX is not "
               "reaching any P4 header pin.\n"
               "       The P4 cannot see C6_IO12/C6_IO13/C6_U0RXD/C6_U0TXD at "
               "all (those belong to the on-board ESP32-C6), so a jumper one or\n"
               "       two positions off the mark looks exactly like this. "
               "Count header positions against the Waveshare pinout, and check "
               "the head is powered with its app open.\n");
    }

    esp_log_level_set("gpio", gpio_lvl);
    s_cfg = saved;
    if (was_running) flipper_link_start(&s_cfg, NULL);
    return best;
}

#else  /* !LS_HAS_LINK_UART */

/*LS-909  No wired link pins declared for this board. Say so, rather than
   scanning a header that was never measured and reporting a false result. */
int flipper_link_scan_rx(int dwell_ms)
{
    (void)dwell_ms;
    printf("this board declares no wired head-link pins - nothing to scan.\n"
           "  see LS_BOARD_LINK_SCAN_PINS in components/lakeshark/board/variants/\n");
    return -1;
}

int flipper_link_probe_rx(void)
{
    printf("this board declares no wired head-link pins - nothing to probe.\n");
    return -1;
}

#endif /* LS_HAS_LINK_UART */


void flipper_link_inject(const char *line, char *reply, size_t reply_len)
{
    char tmp[FL_LINE_MAX];
    strlcpy(tmp, line, sizeof(tmp));
    handle_line(tmp, reply, reply_len);
}

static void link_write(const char *s, int len)
{
    if (!s_installed) return;
    uart_write_bytes(s_cfg.uart_num, s, len);
    s_tx_lines++;
}

static void link_task(void *arg)
{
    (void)arg;
    char    line[FL_LINE_MAX];
    int     pos = 0;
    char    reply[REPLY_MAX];
    char    tel[TEL_MAX];
    uint8_t rx[128];
    int64_t next_tel_us = 0;

