SAMS0N1TE/LakeShark/main/flipper_link.c
    ESP_LOGI(TAG, "link task up: uart%d rx=GPIO%d tx=GPIO%d %lu baud tel=%dHz",
             s_cfg.uart_num, s_cfg.rx_gpio, s_cfg.tx_gpio,
             (unsigned long)s_cfg.baud, s_cfg.telemetry_hz);

    while (s_run) {
        int n = uart_read_bytes(s_cfg.uart_num, rx, sizeof(rx), pdMS_TO_TICKS(20));
        for (int i = 0; i < n; i++) {
            char c = (char)rx[i];
            if (c == '\n' || c == '\r') {
                if (pos > 0) {
                    line[pos] = '\0';
                    s_rx_lines++;
                    if (s_verbose) ESP_LOGI(TAG, "RX <%s>", line);
                    handle_line(line, reply, sizeof(reply));
                    if (reply[0]) link_write(reply, (int)strlen(reply));
                    pos = 0;
                }
            } else if (pos < FL_LINE_MAX - 1) {
                line[pos++] = c;
            } else {

                pos = 0;
                s_bad_lines++;
            }
        }

        int64_t now = esp_timer_get_time();
        int hz = s_cfg.telemetry_hz;
        bool due = s_stat_now || (hz > 0 && now >= next_tel_us);
        if (due) {
            s_stat_now = false;
            if (hz > 0) next_tel_us = now + (1000000 / hz);
            int len = build_telemetry(tel, sizeof(tel));
            if (len > 0) link_write(tel, len > (int)sizeof(tel) - 1
                                             ? (int)sizeof(tel) - 1 : len);
            char eqline[96];
            int eqn = flipper_link_eq_snapshot(eqline, sizeof(eqline));
            if (eqn > 0) link_write(eqline, eqn);
        }
    }

    ESP_LOGI(TAG, "link task exiting");
    s_task = NULL;
    vTaskDelete(NULL);
}

static esp_err_t link_install(void)
{
    uart_config_t uc = {
        .baud_rate  = (int)s_cfg.baud,
        .data_bits  = UART_DATA_8_BITS,
        .parity     = UART_PARITY_DISABLE,
        .stop_bits  = UART_STOP_BITS_1,
        .flow_ctrl  = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };

    if (uart_is_driver_installed(s_cfg.uart_num)) {
        int found = -1;
        for (int u = SOC_UART_HP_NUM - 1; u >= 1; u--) {
            if (u == CONFIG_ESP_CONSOLE_UART_NUM) continue;
            if (!uart_is_driver_installed(u)) { found = u; break; }
        }
        if (found < 0) return ESP_ERR_NOT_FOUND;
        ESP_LOGW(TAG, "uart%d busy, using uart%d instead", s_cfg.uart_num, found);
        s_cfg.uart_num = found;
    }

    esp_err_t err = uart_driver_install(s_cfg.uart_num, RX_BUF_SZ, TX_BUF_SZ, 0, NULL, 0);
    if (err != ESP_OK) return err;
    err = uart_param_config(s_cfg.uart_num, &uc);
    if (err != ESP_OK) goto fail;
    err = uart_set_pin(s_cfg.uart_num, s_cfg.tx_gpio, s_cfg.rx_gpio,
                       UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    if (err != ESP_OK) goto fail;

    s_installed = true;
    return ESP_OK;

fail:
    uart_driver_delete(s_cfg.uart_num);
    return err;
}

static void link_uninstall(void)
{
    if (!s_installed) return;
    s_installed = false;
    uart_driver_delete(s_cfg.uart_num);

    if (s_cfg.tx_gpio < 0) return;

    gpio_config_t out = {
        .pin_bit_mask = 1ULL << s_cfg.tx_gpio,
        .mode         = GPIO_MODE_OUTPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    gpio_config(&out);
    gpio_set_level(s_cfg.tx_gpio, 1);
}

/*LS-201*/
#define LS_HEAL_MAX_SWEEPS 3

static void heal_task(void *arg)
{
    (void)arg;
    int  sweeps   = 0;
    bool told_ble = false;
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(60000));
        if (!s_run || s_rx_lines > 0) continue;
        if (s_tx_lines < 50) continue;

        if (ble_link_state() == BLE_LINK_READY) {
            if (!told_ble) {
                ESP_LOGI(TAG, "head is on BLE - leaving the UART pins alone");
                told_ble = true;
            }
            continue;
        }

        if (sweeps >= LS_HEAL_MAX_SWEEPS) continue;
        sweeps++;

        ESP_LOGW(TAG, "no RX after %lu TX frames - sweeping header pins for the head "
                      "(attempt %d of %d)",
                 (unsigned long)s_tx_lines, sweeps, LS_HEAL_MAX_SWEEPS);
        int pin = flipper_link_scan_rx(700);
        if (pin >= 0 && pin != s_cfg.rx_gpio) {
            flipper_link_cfg_t c = s_cfg;
            c.rx_gpio = pin;
            ESP_LOGW(TAG, "adopting GPIO%d as link RX", pin);
            flipper_link_reconfigure(&c);
        } else if (sweeps >= LS_HEAL_MAX_SWEEPS) {
            ESP_LOGW(TAG, "giving up on the UART sweep - use 'link pins <rx> <tx>' "
                          "or run the head over BLE");
        }
    }
}

esp_err_t flipper_link_start(const flipper_link_cfg_t *cfg,
                             const flipper_link_host_t *host)
{
    if (s_run) return ESP_ERR_INVALID_STATE;
    if (cfg)  s_cfg  = *cfg;
    if (host) s_host = *host;

    esp_err_t err = link_install();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "uart install failed: %s", esp_err_to_name(err));
        return err;
    }

    s_run = true;

    if (xTaskCreate(link_task, "fliplink", 6144, NULL, 5, &s_task) != pdPASS) {
        s_run = false;
        link_uninstall();
        return ESP_ERR_NO_MEM;
    }

    static bool healer_started = false;
    if (!healer_started) {
        healer_started = (xTaskCreate(heal_task, "fl_heal", 4096, NULL, 3, NULL) == pdPASS);
    }

    /*LS-220*/
    /* Include the version in the HELLO so the head sees which firmware it
       just connected to without having to ask.  A stale head that only
       parses `+HELLO %d LakeShark` still matches (the version is appended
       after "LakeShark ", not before). */
    char v[LS_VERSION_LINE_MAX];
    ls_version_line(v, sizeof(v));
    sanitize(v);
    char hello[LS_VERSION_LINE_MAX + 32];
    int  len = snprintf(hello, sizeof(hello), "+HELLO %d LakeShark %s\n",
                        FLIPPER_LINK_PROTO_VERSION, v);
    link_write(hello, len);
    return ESP_OK;
}

void flipper_link_stop(void)
{
    if (!s_run) return;
    s_run = false;
    for (int i = 0; i < 50 && s_task; i++) vTaskDelay(pdMS_TO_TICKS(10));
    link_uninstall();
}

bool flipper_link_running(void) { return s_run; }

esp_err_t flipper_link_reconfigure(const flipper_link_cfg_t *cfg)
{
    bool was = s_run;
    if (was) flipper_link_stop();
    if (cfg) s_cfg = *cfg;
    if (!was) return ESP_OK;
    return flipper_link_start(&s_cfg, NULL);
}

void flipper_link_get_cfg(flipper_link_cfg_t *out) { if (out) *out = s_cfg; }

int flipper_link_sdr_stall_s(void) { return sdr_stall_s(); }

void flipper_link_set_verbose(bool en) { s_verbose = en; }
bool flipper_link_verbose(void)        { return s_verbose; }

void flipper_link_stats(uint32_t *rx_lines, uint32_t *tx_lines, uint32_t *bad_lines)
{
    if (rx_lines)  *rx_lines  = s_rx_lines;
    if (tx_lines)  *tx_lines  = s_tx_lines;
    if (bad_lines) *bad_lines = s_bad_lines;
}

